In [107]:
import pandas as pd
import chardet
import mysql.connector as db
import sqlalchemy
from sqlalchemy import create_engine

In [5]:
df_sales = pd.read_csv('data/Sales.csv')
df_stores = pd.read_csv('data/Stores.csv')
df_products = pd.read_csv('data/Products.csv')

# Detect encoding for Sales.csv
with open('data/Customers.csv', 'rb') as f:
    result = chardet.detect(f.read())
df_customers = pd.read_csv('data/Customers.csv', encoding=result['encoding'])

df_exchange = pd.read_csv('data/Exchange_Rates.csv')

--------------------------------------------------------------------

df_sales pre process

In [9]:
df_sales.head()

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,NaN,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD
2,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD
3,366002,1,1/1/2016,1/12/2016,266019,0,1106,7,CAD
4,366002,2,1/1/2016,1/12/2016,266019,0,373,1,CAD

In [7]:
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  object
 3   Delivery Date  13165 non-null  object
 4   CustomerKey    62884 non-null  int64
 5   StoreKey       62884 non-null  int64
 6   ProductKey     62884 non-null  int64
 7   Quantity       62884 non-null  int64
 8   Currency Code  62884 non-null  object
dtypes: int64(6), object(3)
memory usage: 4.3+ MB

In [22]:
copy_sales = df_sales.copy()

In [23]:
#dropping column because of missing vALUES
copy_sales = copy_sales.drop(['Delivery Date'], axis=1)

In [26]:
#convert data type to date format
copy_sales['Order Date'] = pd.to_datetime(copy_sales['Order Date'])

In [27]:
copy_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  datetime64[ns]
 3   CustomerKey    62884 non-null  int64
 4   StoreKey       62884 non-null  int64
 5   ProductKey     62884 non-null  int64
 6   Quantity       62884 non-null  int64
 7   Currency Code  62884 non-null  object
dtypes: datetime64[ns](1), int64(6), object(1)
memory usage: 3.8+ MB

In [30]:
copy_sales.head()

,Order Number,Line Item,Order Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,2016-01-01,265598,10,1304,1,CAD
1,366001,1,2016-01-01,1269051,0,1048,2,USD
2,366001,2,2016-01-01,1269051,0,2007,1,USD
3,366002,1,2016-01-01,266019,0,1106,7,CAD
4,366002,2,2016-01-01,266019,0,373,1,CAD

---------------------------------------------------------------------

df_stores pre process

In [41]:
df_stores.head()

   StoreKey    Country                         State  Square Meters  Open Date
0         1  Australia  Australian Capital Territory          595.0   1/1/2008
1         2  Australia            Northern Territory          665.0  1/12/2008
2         3  Australia               South Australia         2000.0   1/7/2012
3         4  Australia                      Tasmania         2000.0   1/1/2010
4         5  Australia                      Victoria         2000.0  12/9/2015

In [42]:
df_stores.shape

(67, 5)

In [43]:
df_stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StoreKey       67 non-null     int64
 1   Country        67 non-null     object
 2   State          67 non-null     object
 3   Square Meters  66 non-null     float64
 4   Open Date      67 non-null     object
dtypes: float64(1), int64(1), object(3)
memory usage: 2.7+ KB

In [44]:
copy_stores = df_stores.copy()

In [45]:
#convert data type to date format
copy_stores['Open Date'] = pd.to_datetime(copy_stores['Open Date'])

In [46]:
#filling missing data
copy_stores['Square Meters'] = copy_stores['Square Meters'].fillna(copy_stores['Square Meters'].mean())

In [47]:
copy_stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StoreKey       67 non-null     int64
 1   Country        67 non-null     object
 2   State          67 non-null     object
 3   Square Meters  67 non-null     float64
 4   Open Date      67 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 2.7+ KB

------------------------------------------------

df_products pre process

In [48]:
df_products.head()

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,$6.62,$12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,$6.62,$12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,$7.40,$14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,$11.00,$21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,$11.00,$21.57,101,MP4&MP3,1,Audio

In [50]:
df_products.shape

(2517, 10)

In [57]:
df_products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   object
 5   Unit Price USD  2517 non-null   object
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: int64(3), object(7)
memory usage: 196.8+ KB

In [76]:
copy_products = df_products.copy()

In [77]:
#removing dollar sign
copy_products['Unit Cost USD'] = copy_products['Unit Cost USD'].str.replace('$', '')
copy_products['Unit Price USD'] = copy_products['Unit Price USD'].str.replace('$', '')

In [88]:
copy_products.head()

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,6.62,12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,6.62,12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,7.40,14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,11.00,21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,11.00,21.57,101,MP4&MP3,1,Audio

In [80]:
# Convert columns to float
copy_products['Unit Cost USD'] = copy_products['Unit Cost USD'].astype(float)
copy_products['Unit Price USD'] = copy_products['Unit Price USD'].astype(float)

ValueError: could not convert string to float: '1,060.22 '

In [82]:
#removing comma and spaces 
copy_products['Unit Cost USD'] = copy_products['Unit Cost USD'].str.replace(',', '').str.replace(' ', '')
copy_products['Unit Price USD'] = copy_products['Unit Price USD'].str.replace(',', '').str.replace(' ', '')

In [84]:
# Convert columns to float
copy_products['Unit Cost USD'] = copy_products['Unit Cost USD'].astype(float)
copy_products['Unit Price USD'] = copy_products['Unit Price USD'].astype(float)

In [85]:
copy_products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   float64
 5   Unit Price USD  2517 non-null   float64
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: float64(2), int64(3), object(5)
memory usage: 196.8+ KB

------------------------------------

In [87]:
copy_products.head()

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,6.62,12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,6.62,12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,7.40,14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,11.00,21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,11.00,21.57,101,MP4&MP3,1,Audio

df_customers pre process

In [58]:
df_customers.head()

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,7/3/1939
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,9/27/1979
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,5/26/1947
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,9/17/1957
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,11/19/1965

In [59]:
df_customers.shape

(15266, 10)

In [60]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15266 entries, 0 to 15265
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15266 non-null  int64
 1   Gender       15266 non-null  object
 2   Name         15266 non-null  object
 3   City         15266 non-null  object
 4   State Code   15256 non-null  object
 5   State        15266 non-null  object
 6   Zip Code     15266 non-null  object
 7   Country      15266 non-null  object
 8   Continent    15266 non-null  object
 9   Birthday     15266 non-null  object
dtypes: int64(1), object(9)
memory usage: 1.2+ MB

In [62]:
copy_customers = df_customers.copy()

In [63]:
#convert data type to date format
copy_customers['Birthday'] = pd.to_datetime(copy_customers['Birthday'])

In [74]:
copy_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15266 entries, 0 to 15265
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15266 non-null  int64
 1   Gender       15266 non-null  object
 2   Name         15266 non-null  object
 3   City         15266 non-null  object
 4   State Code   15256 non-null  object
 5   State        15266 non-null  object
 6   Zip Code     15266 non-null  object
 7   Country      15266 non-null  object
 8   Continent    15266 non-null  object
 9   Birthday     15266 non-null  datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(8)
memory usage: 1.2+ MB

In [75]:
copy_customers.head()

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,1939-07-03
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,1979-09-27
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,1947-05-26
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,1957-09-17
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,1965-11-19

-----------------------------------------

df_exchange pre process

In [65]:
df_exchange

            Date Currency  Exchange
0       1/1/2015      USD    1.0000
1       1/1/2015      CAD    1.1583
2       1/1/2015      AUD    1.2214
3       1/1/2015      EUR    0.8237
4       1/1/2015      GBP    0.6415
...          ...      ...       ...
11210  2/20/2021      USD    1.0000
11211  2/20/2021      CAD    1.2610
11212  2/20/2021      AUD    1.2723
11213  2/20/2021      EUR    0.8238
11214  2/20/2021      GBP    0.7126

[11215 rows x 3 columns]

In [66]:
df_exchange.shape

(11215, 3)

In [67]:
df_exchange.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      11215 non-null  object
 1   Currency  11215 non-null  object
 2   Exchange  11215 non-null  float64
dtypes: float64(1), object(2)
memory usage: 263.0+ KB

In [69]:
copy_exchange = df_exchange.copy()

In [70]:
#convert data type to date format
copy_exchange['Date'] = pd.to_datetime(copy_exchange['Date'])

In [73]:
copy_exchange.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      11215 non-null  datetime64[ns]
 1   Currency  11215 non-null  object
 2   Exchange  11215 non-null  float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 263.0+ KB

In [89]:
copy_exchange.head()

        Date Currency  Exchange
0 2015-01-01      USD    1.0000
1 2015-01-01      CAD    1.1583
2 2015-01-01      AUD    1.2214
3 2015-01-01      EUR    0.8237
4 2015-01-01      GBP    0.6415

--------------------------------------------

HERE I AM GOING TO EXPLORE THE DATA

In [166]:
# Find dataframes starting with "copy" using locals()
all_dfs = []
for name, obj in locals().items():
    if isinstance(obj, pd.DataFrame) and name.startswith('copy_'):
        all_dfs.append(obj)

In [167]:
for df in all_dfs:
    df.columns = df.columns.str.replace(' ', '').str.replace('_', '')

In [168]:
products = copy_products.columns.to_list()
customers=copy_customers.columns.to_list()
sales=copy_sales.columns.to_list()
stores=copy_stores.columns.to_list()
exchange=copy_exchange.columns.to_list()

In [169]:
data = {
    'products': products,
    'customers': customers,
    'sales': sales,
    'stores': stores,
    'exchange': exchange
}

# Convert the dictionary to a DataFrame
df = pd.DataFrame(dict([(k, pd.Series(v)) for k, v in data.items()]))

df

       products    customers         sales        stores  exchange
0    ProductKey  CustomerKey   OrderNumber      StoreKey      Date
1   ProductName       Gender      LineItem       Country  Currency
2         Brand         Name     OrderDate         State  Exchange
3         Color         City   CustomerKey  SquareMeters       NaN
4   UnitCostUSD    StateCode      StoreKey      OpenDate       NaN
5  UnitPriceUSD        State    ProductKey           NaN       NaN
6   Subcategory      ZipCode      Quantity           NaN       NaN
7      Category      Country  CurrencyCode           NaN       NaN
8           NaN    Continent           NaN           NaN       NaN
9           NaN     Birthday           NaN           NaN       NaN

In [97]:
copy_products = copy_products.drop(['SubcategoryKey','CategoryKey'],axis=1)

--------------------------------------

Connect with mysql

In [99]:
db_connection = db.connect(
  host="localhost",
  user="root",
  password="root"
)

db_connection

In [100]:
mycursor = db_connection.cursor(buffered=True)

In [101]:

mycursor.execute("CREATE DATABASE IF NOT EXISTS global_electronics")

In [170]:
mydb = db.connect(
    host="localhost",
    user="root",
    password="root",
    database="global_electronics"
)

mycursor.execute("USE global_electronics")

In [180]:
mycursor.execute('''
    CREATE TABLE IF NOT EXISTS products (
        ProductKey INT NOT NULL,
        ProductName VARCHAR(255) NOT NULL,
        Brand VARCHAR(255) NOT NULL,
        Color VARCHAR(255) NOT NULL,
        UnitCostUSD FLOAT NOT NULL, 
        UnitPriceUSD FLOAT NOT NULL,
        Subcategory VARCHAR(255) NOT NULL,
        Category VARCHAR(255) NOT NULL,
        PRIMARY KEY (ProductKey)
    )
''')
mydb.commit()

In [181]:
mycursor.execute('''
    CREATE TABLE IF NOT EXISTS Customers (
    CustomerKey INT NOT NULL,
    Gender VARCHAR(255) NOT NULL,
    Name VARCHAR(255) NOT NULL,
    City VARCHAR(255) NOT NULL,
    StateCode VARCHAR(255),
    State VARCHAR(255) NOT NULL,
    ZipCode VARCHAR(255) NOT NULL,
    Country VARCHAR(255) NOT NULL,
    Continent VARCHAR(255) NOT NULL,
    Birthday DATETIME NOT NULL,
    PRIMARY KEY (CustomerKey)
)
''')
mydb.commit()

In [182]:
mycursor.execute('''
    CREATE TABLE if not exists Stores (
    StoreKey INT NOT NULL,
    Country VARCHAR(100) NOT NULL,
    State VARCHAR(100) NOT NULL,
    SquareMeters FLOAT NOT NULL,
    OpenDate DATETIME NOT NULL,
    PRIMARY KEY (StoreKey)
);
''')
mydb.commit()

In [183]:
mycursor.execute('''
    CREATE TABLE if not exists exchange_rates (
    Date DATETIME NOT NULL,
    Currency VARCHAR(255) NOT NULL,
    Exchange FLOAT NOT NULL
);
''')
mydb.commit()

In [184]:
mycursor.execute('''
    CREATE TABLE if not exists Orders (
    OrderNumber INT NOT NULL,
    LineItem INT NOT NULL,
    OrderDate DATETIME NOT NULL,
    CustomerKey INT NOT NULL,
    StoreKey INT NOT NULL,
    ProductKey INT NOT NULL,
    Quantity INT NOT NULL,
    CurrencyCode VARCHAR(10) NOT NULL,
    PRIMARY KEY (OrderNumber),
    FOREIGN KEY (ProductKey) REFERENCES products(ProductKey),
    FOREIGN KEY (CustomerKey) REFERENCES Customers(CustomerKey),
    FOREIGN KEY (StoreKey) REFERENCES Stores(StoreKey),
    FOREIGN KEY (CurrencyCode,OrderDate) REFERENCES exchange_rates(Currency,Date)
);
''')
mydb.commit()

DatabaseError: 1822 (HY000): Failed to add the foreign key constraint. Missing index for constraint 'orders_ibfk_4' in the referenced table 'exchange_rates'

In [185]:
mycursor.execute('''
    CREATE INDEX idx_exchange_rates ON exchange_rates (Currency, Date);
''')
mydb.commit()

In [186]:
mycursor.execute('''
    CREATE TABLE if not exists Orders (
    OrderNumber INT NOT NULL,
    LineItem INT NOT NULL,
    OrderDate DATETIME NOT NULL,
    CustomerKey INT NOT NULL,
    StoreKey INT NOT NULL,
    ProductKey INT NOT NULL,
    Quantity INT NOT NULL,
    CurrencyCode VARCHAR(10) NOT NULL,
    FOREIGN KEY (ProductKey) REFERENCES products(ProductKey),
    FOREIGN KEY (CustomerKey) REFERENCES Customers(CustomerKey),
    FOREIGN KEY (StoreKey) REFERENCES Stores(StoreKey),
    FOREIGN KEY (CurrencyCode,OrderDate) REFERENCES exchange_rates(Currency,Date)
);
''')
mydb.commit()

inserting data to mysql using sqlalchamy

In [187]:
engine = create_engine('mysql+mysqlconnector://root:root@localhost/global_electronics', echo=False)

In [188]:
copy_products.to_sql('products', con=engine, if_exists='append', index=False)
copy_customers.to_sql('customers', con=engine, if_exists='append', index=False)
copy_stores.to_sql('stores', con=engine, if_exists='append', index=False)
copy_exchange.to_sql('exchange_rates', con=engine, if_exists='append', index=False)
copy_sales.to_sql('orders', con=engine, if_exists='append', index=False)

62884